wujique/stm32f407/board_dev/stm324xg_eval_sdio_sd.c
/*


*/
#include "diskio.h"

/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/

DSTATUS SD_disk_initialize (
                         BYTE drv		/* Physical drive number (0) */
                           )
{
  	SD_Error result;

  	result = SD_Init();
	
  	if(SD_OK == result)
  		return RES_OK;
	else
		return RES_ERROR;
}


/*-----------------------------------------------------------------------*/
/* Get Disk Status                                                       */
/*-----------------------------------------------------------------------*/

DSTATUS SD_disk_status (
                     BYTE drv		/* Physical drive number (0) */
                       )
{
  //if (drv) return STA_NOINIT;		/* Supports only single drive */
  return RES_OK;
}



/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/
DRESULT SD_disk_read (
                   BYTE pdrv,			/* Physical drive number (0) */
                   BYTE *buff,			/* Pointer to the data buffer to store read data */
                   DWORD sector,		/* Start sector number (LBA) */
                   UINT count			/* Sector count (1..255) */
                     )
{
	SD_Error result;
	DRESULT res;

	//wjq_log(LOG_DEBUG, "SD_disk_read: %08x, sector:%d, count:%d\r\n", buff, sector, count);

	result = SD_ReadMultiBlocks(buff, sector*512, 512, count);
	if(result == SD_OK)
	{
		result = SD_WaitReadOperation();
		/* Wait until end of DMA transfer */
		while(SD_GetStatus() != SD_TRANSFER_OK);
	}
		// translate the reslut code here
	if(SD_OK == result)
		res = RES_OK;
	else
		res =  RES_ERROR;


	return res;
}

/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/


DRESULT SD_disk_write (
                    BYTE pdrv,			/* Physical drive number (0) */
                    const BYTE *buff,	/* Pointer to the data to be written */
                    DWORD sector,		/* Start sector number (LBA) */
                    UINT count			/* Sector count (1..255) */
                      )
{
	SD_Error result;
	DRESULT res;

	result = SD_WriteMultiBlocks((uint8_t *)buff, sector*512, 512, count);
	if(result == SD_OK)
	{
		/* Check if the Transfer is finished */
    	result = SD_WaitWriteOperation();
    	while(SD_GetStatus() != SD_TRANSFER_OK);
	}
	
	if(SD_OK == result)
  		res = RES_OK;
	else
		res = RES_ERROR;

	return res;
}


DRESULT SD_disk_ioctl (
                    BYTE drv,		/* Physical drive number (0) */
                    BYTE ctrl,		/* Control code */
                    void *buff		/* Buffer to send/receive control data */
                      )
{
  DRESULT res = RES_OK;
  
  //if (drv) return RES_PARERR;
  
  res = RES_ERROR;
  
  //if (Stat & STA_NOINIT) return RES_NOTRDY;
  
  switch (ctrl) {
  case CTRL_SYNC :		/* Make sure that no pending write process */
    
    res = RES_OK;
    break;
    
  case GET_SECTOR_COUNT :	/* Get number of sectors on the disk (DWORD) */
    
    *(DWORD*)buff = (DWORD) SDCardInfo.CardCapacity/512;;
    res = RES_OK;
    break;
  case GET_SECTOR_SIZE :	/* Get R/W sector size (WORD) */
    *(WORD*)buff = 512;
    res = RES_OK;
    break;
    
  case GET_BLOCK_SIZE :	/* Get erase block size in unit of sector (DWORD) */
    
    *(DWORD*)buff = SDCardInfo.CardBlockSize;;
    res = RES_OK;
    break;
    
    
  default:
    res = RES_PARERR;
  }
  
  return res;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */  

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

/*
    wujique,将官方例程中的main.c内的测试程序移植到此处
*/


/** @addtogroup STM32F4xx_StdPeriph_Examples
  * @{
  */

/** @addtogroup SDIO_uSDCard
  * @{
  */
#if 0
/* Private typedef -----------------------------------------------------------*/
typedef enum {FAILED = 0, PASSED = !FAILED} TestStatus;

/* Private define ------------------------------------------------------------*/
#define BLOCK_SIZE            512 /* Block Size in Bytes */

#define NUMBER_OF_BLOCKS      100  /* For Multi Blocks operation (Read/Write) */
#define MULTI_BUFFER_SIZE    (BLOCK_SIZE * NUMBER_OF_BLOCKS)

#define SD_OPERATION_ERASE          0
#define SD_OPERATION_BLOCK          1
#define SD_OPERATION_MULTI_BLOCK    2 
#define SD_OPERATION_END            3

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint8_t aBuffer_Block_Tx[BLOCK_SIZE]; 
uint8_t aBuffer_Block_Rx[BLOCK_SIZE];
uint8_t aBuffer_MultiBlock_Tx[MULTI_BUFFER_SIZE];
uint8_t aBuffer_MultiBlock_Rx[MULTI_BUFFER_SIZE];

__IO TestStatus EraseStatus = FAILED;
__IO TestStatus TransferStatus1 = FAILED;
__IO TestStatus TransferStatus2 = FAILED;

SD_Error Status = SD_OK;
__IO uint32_t uwSDCardOperation = SD_OPERATION_ERASE;

/* Private function prototypes -----------------------------------------------*/
static void SD_EraseTest(void);
static void SD_SingleBlockTest(void);
static void SD_MultiBlockTest(void);
static void Fill_Buffer(uint8_t *pBuffer, uint32_t BufferLength, uint32_t Offset);

static TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint32_t BufferLength);
static TestStatus eBuffercmp(uint8_t* pBuffer, uint32_t BufferLength);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int dev_sdio_test(void)
{
  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       files (startup_stm32f40_41xxx.s/startup_stm32f427_437xx.s)
       before to branch to application main. To reconfigure the default setting 
       of SystemInit() function, refer to system_stm32f4xx.c file
     */

  /* NVIC Configuration */

    wjq_log(LOG_FUN, "\r\n-------dev_sdio_test----------\r\n");
  /*------------------------------ SD Init ---------------------------------- */
  if((Status = SD_Init()) != SD_OK)
  {
    //STM_EVAL_LEDOn(LED4); 
    wjq_log(LOG_FUN, "\r\n-------SD_Init:%d----------\r\n",Status);
  }
  else
  {
    wjq_log(LOG_FUN, "\r\n-------SD_Init ok----------\r\n"); 
  }
        
  while((Status == SD_OK) && (uwSDCardOperation != SD_OPERATION_END) && (SD_Detect()== SD_PRESENT))
  {
    switch(uwSDCardOperation)
    {
      /*-------------------------- SD Erase Test ---------------------------- */
      case (SD_OPERATION_ERASE):
      {
        wjq_log(LOG_FUN, "\r\n-------SD_EraseTest....----------\r\n");
        SD_EraseTest();
        wjq_log(LOG_FUN, "\r\n-------SD_EraseTest ok----------\r\n");
        uwSDCardOperation = SD_OPERATION_BLOCK;
        break;
      }
      /*-------------------------- SD Single Block Test --------------------- */
      case (SD_OPERATION_BLOCK):
      {
        wjq_log(LOG_FUN, "\r\n-------SD_SingleBlockTest...----------\r\n");
        SD_SingleBlockTest();
        wjq_log(LOG_FUN, "\r\n-------SD_SingleBlockTest ok----------\r\n");
        uwSDCardOperation = SD_OPERATION_MULTI_BLOCK;
        break;
      }       
      /*-------------------------- SD Multi Blocks Test --------------------- */
      case (SD_OPERATION_MULTI_BLOCK):
      {
        wjq_log(LOG_FUN, "\r\n-------SD_MultiBlockTest...----------\r\n");
        SD_MultiBlockTest();
        wjq_log(LOG_FUN, "\r\n-------SD_MultiBlockTest ok----------\r\n");
        uwSDCardOperation = SD_OPERATION_END;
        break;
      }              
    }
  }

  wjq_log(LOG_FUN, "\r\n-------dev_sdio_test finish----------\r\n");
  /* Infinite loop */
  while (1)
  {
  }
}

/**
  * @brief  Tests the SD card erase operation.
  * @param  None
  * @retval None
  */
static void SD_EraseTest(void)
{
  /*------------------- Block Erase ------------------------------------------*/
  if (Status == SD_OK)
  {
    /* Erase NumberOfBlocks Blocks of WRITE_BL_LEN(512 Bytes) */
    Status = SD_Erase(0x00, (BLOCK_SIZE * NUMBER_OF_BLOCKS));
  }

  if (Status == SD_OK)
  {
    Status = SD_ReadMultiBlocks(aBuffer_MultiBlock_Rx, 0x00, BLOCK_SIZE, NUMBER_OF_BLOCKS);

    /* Check if the Transfer is finished */
    Status = SD_WaitReadOperation();

    /* Wait until end of DMA transfer */
    while(SD_GetStatus() != SD_TRANSFER_OK);

