wujique/stm32f407/board_dev/stm324xg_eval_sdio_sd.c
			if((fno.fattrib & AM_MASK) == AM_DIR)
			{
				strcat(tmp, "\n"); 
				wjq_log(LOG_INFO, "%s\r\n",(void *)tmp);
			}
			else
			{
				strcat(tmp, "\n"); 
				wjq_log(LOG_INFO, "%s\r\n",(void *)tmp);
			}

			if(((fno.fattrib & AM_MASK) == AM_DIR))
			{
				strcpy(path_tmp, path);
				strcat(path_tmp, fn);
				wjq_log(LOG_INFO, "explore dir:%s\r\n", path_tmp);
				//vfs_explore_disk(path_tmp, recu_level+1);
			}
			
		}
	}
	else
	{

		wjq_log(LOG_FUN, "open dir err:%d\r\n", res);
	}
	return res;
}
FATFS Sdfatfs;
FIL Sdfile;

s32 fun_mount_sd(void)
{
	FRESULT res;

	/* Initialises the File System*/
	res = f_mount(&Sdfatfs, "1:/", 1);
	
	if ( res != FR_OK ) 
	{
	  /* efs initialisation fails*/
	  wjq_log(LOG_FUN, "> sd Cannot initialize File System:%d\r\n", res);
	  return -1;
	}
	
	//vfs_explore_disk("1:/", 1);
	
	wjq_log(LOG_FUN, "> sd File System initialized.\n");
	return 0;
}

/**
 *@brief:      tf_file_test
 *@details:    测试SD卡文件系统，进行测试前需要挂载TF卡
                  
 *@param[in]   void  
 *@param[out]  无
 *@retval:     
 */
FIL TfCardTestFile;

s32 tf_file_test(void)
{
	FRESULT fres;
	u32 len;
	
	fres=f_open(&TfCardTestFile,(const TCHAR*)"1:tfcard_test.txt", FA_OPEN_ALWAYS | FA_WRITE); 
	if(fres != FR_OK)			//文件创建失败
	{
		wjq_log(LOG_FUN, "create rec file err:%d!\r\n", fres);
		
	}
	fres = f_write(&TfCardTestFile,(const void*)"this is a tf card test file!",29, &len);
	if(fres != FR_OK
		|| len != 29)
	{
		wjq_log(LOG_FUN, "write err\r\n");
	}

	f_close(&TfCardTestFile);
	wjq_log(LOG_FUN, "tf card file sys test finish!\r\n");
	
	while(1)
	{
		
	}
}


